from flask import Flask, render_template


app = Flask(__name__)


@app.route("/")
def index():
    """Делаем запрос в бд чтобы взять первые 30 карточек сохраняем их в cards_list"""
    cards_list = [["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"],
                  ["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"],
                  ["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"],
                  ["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"],
                  ["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"],
                  ["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"],
                  ["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"],
                  ["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"],
                  ["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"],
                  ["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"],
                  ["id", "название", "тема", "автор", "из какого альбома", "сама картинка", "описание", "все доп параментры", "приватность"]] # лучше переделать в объект питона
    return render_template("index.html", cards_list=cards_list)


@app.route("/card")
def test_card():
    return render_template("card.html")


if __name__ == "__main__":
    app.run()
